data/JAVA/Generate_Excel/data/input/soaprequest.xml

<?xml version="1.0" encoding="utf-8" ?>
<soap:Envelope xmlns:nsrm="http://xmlns.oracle.com/communications/inventory/webservice/nsrm" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header>
      <wsse:Security soap:mustUnderstand="true" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
         <wsse:UsernameToken wsu:Id="UsernameToken-1D87E171901A3B6CCE14988304125202">
            <wsse:Username>uim_admin</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">passwst1n</wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
   </soap:Header>
   <soap:Body>
      <nsrm:importEntityRequestType>
         <nsrm:octet/>
      </nsrm:importEntityRequestType>
   </soap:Body>
</soap:Envelope>